import { Helmet } from "react-helmet";
import classes from "./registerRules.module.css";
import Navbar from "../../components/navbar/navbar";
import Footer from "../../components/footer/footer";

export const RegisterRules: React.FC = () => {
  const definitions = [
    {
      id: "1",
      title: "شرکت",
      explain:
        " شرکت ایده پردازان نیکداد اروین که نسبت به ارائه خدمات ایران بیزینس کاپ اقدام می کند. ",
    },
    {
      id: "2",
      title: "شرکت ایده پردازان نیکداد اروین",
      explain:
        "ایده پردازان نیکداد اروین ، شرکتی با مسئولیت محدود است که با همکاری گلدن اسپورتس اتریش برای اولین بار در ایران محوریت فعالیت خود را برای سازمان دهی  و مدیریت حوزه در ورزش و سرگرمی با استفاده از برترین تکنولوژی های تحت وب و دانش برنامه نویسی روز دنیا قرار داده است.",
    },
    {
      id: "3",
      title: "ایران بیزینس کاپ",
      explain: "تورنمنت فوتسال برگزار شده توسط ایده پردازان نیکداد اروین",
    },
    {
      id: "4",
      title: "قرار داد خصوصی",
      explain:
        " توافقی کتبی یا الکترونیکی فی ما بین شرک و دیگر طرف تجاری جهت ثبت نام در مسابقات ایران بیزینس کاپ است.",
    },
    {
      id: "5",
      title: "دیگر طرف تجاری",
      explain:
        "اشخاص حقیقی یا حقوقی که برابر قرارداد خصوصی، حق شرکت در مسابقات ایران بیزنس کاپ را دارند.",
    },
  ];

  const rules = [
    {
      id: "1",
      title: "مسئولیت شرکت ایده پردازان نیکداد اروین",
      explain: [
        {
          id: "1",
          text: "اطلاعاتی که کاربر در خلال ثبت‌نام در سایت وارد کرده است کاملاّ محفوظ خواهد ماند و به هیچ شخص یا سازمان دیگری ارائه نخواهد شد، مگر در راستای قوانین و مقررات کشور و با دستور قانونی از مراجع قضایی ذی‌صلاح و ذی‌ربط. در این موارد هیچ گونه مسئولیت قانونی برای جبران خسارت و یا موارد دیگر برای ایران بیزنس کاپ وجود ندارد و کاربران با استفاده از خدمات ایران بیزنس کاپ و قبول شرایط و مقررات در هنگام ثبت نام، رضایت خود را صراحتاً اعلام می‌دارند.",
        },
        {
          id: "2",
          text: "تصمیم راجع به موفق یا ناموفق بودن احراز هویت فقط در اختیار ایران بیزنس کاپ خواهد بود و ایران بیزنس کاپ می‌تواند احراز هویت یک کاربر را به تشخیص خود قبول یا رد کند.",
        },
        {
          id: "3",
          text: "ایران بیزنس کاپ این حق را برای خود محفوظ می‌دارد که شرایط و مقررات خود را در هر زمان که بخواهد و با اختیار و صلاحدید خود تغییر دهد. همچنین با اطلاع رسانی از طرق مختلف، از قبیل اعلام در وبسایت یا در کانال های رسمی ایران بیزنس کاپ در شبکه‌های اجتماعی، کاربران را از این تغییرات آگاه می‌سازد. بدیهی است که استفاده مداوم از خدمات ایران بیزنس کاپ به عنوان پذیرش مقررات اصلاح شده تلقی خواهد شد. اگر کاربر با هرگونه اصلاح و تغییر شرایط موافق نبود، ضروری است که استفاده از خدمات ایران بیزنس کاپ را متوقف کند. ایران بیزنس کاپ به کاربران خود توصیه می‌کند که شرایط را مرور کنند تا از درک کامل مقررات و ضوابط اعمال شده برای دسترسی و استفاده از خدمات اطمینان حاصل کنند.",
        },
        {
          id: "4",
          text: "اگر تجهیزات یا تسهیلات موجود برای برگزاری بازی‌ها مشکلاتی داشته باشد، شرکت مسئولیت را پذیرفته و مسابقات بعد از رفع مشکلات ادامه پیدا خواهند کرد.",
        },
        {
          id: "5",
          text: "ارائه کارت بیمه حوادث ورزشی معتبر از فدراسیون پزشکی ورزشی جمهوری اسلامی ایران به عهده شرکت خواهد بود.",
        },
        {
          id: "6",
          text: "مسئولیت بررسی اولیه و انطباق تمامی مدارک لازم ورزشکاران جهت اعزام به مسابقات قهرمانی کشور، برعهده ایران بیزینس کاپ خواهد بود.",
        },
        {
          id: "7",
          text: "مسئولیت نظارت،کنترل و تایید مدارک شرکت کنندگان در رقابت های قهرمانی کارگران کشور و تهیه و ارائه گزارش کیفی و کمی مسابقات بر عهده ایران بیزینس کاپ خواهد بود.به تیم قهرمان، نایب قهرمان و سوم و بهترین گلزن این رقابتها جوایزی اهدا خواهد شد. از بازیکن و تیم بااخلاق نیز تقدیر بعمل خواهد آمد.",
        },
        {
          id: "8",
          text: "قهرمان و نایب قهرمان هردوره از مسابقات ایران بیزنس کاپ به مرحله مسابقات فینال قهرمانی کشور راه خواهند یافت و برنده ی نهایی مسابقات فینال قهرمانی کشور از طرف ایران بیزینس کاپ به عنوان نماینده ایران به مسابقات یورو بیزینس کاپ اعزام خواهد شد.",
        },
        {
          id: "9",
          text: "هزینه شرکت در مسابقات فینال قهرمانی کشوری وهمچنین هزینه اعزام قهرمان مسابقات فینال قهرمانی کشوری به عنوان نماینده ایران به یورو بیزنس کاپ، به عهده شرکت ایده پردازان نیکداد اروین خواهد بود.",
        },
        {
          id: "10",
          text: " تامین هزینه های برگزاری در کلیه امور(سالن، نیروی انتظامی، پزشکی و داوری و ...) به عهده میزبان مسابقات خواهد بود.کلیه هزینه های اسکان، خورد و خوراک و رفت و آمد تیم ها به عهده خودشان می باشد.  ",
        },
        {
          id: "11",
          text: "مسئولیت حسن برگزاری فنی رویداد با ایران بیزنس کاپ خواهد بود.",
        },
      ],
    },
    {
      id: "2",
      title: "وظیفه شرکت کنندگان",
      explain: [
        {
          id: "1",
          text: "کاربران موظف‌اند کلیه مفاد این تعهدنامه را قبل از ثبت نام مطالعه کرده و صرفاً در صورت پذیرش کامل آن اقدام به ثبت‌نام کنند. استفاده از خدمات ایران بیزینس کاپ به این معنی است که کاربر قوانین را کاملاّ خوانده، فهمیده و قبول کرده است.",
        },
        {
          id: "2",
          text: "فعالیت‌های ایران بیزنس کاپ مطابق با قوانین جمهوری اسلامی ایران است و کاربران نیز می‌پذیرند که در چارچوب قوانین جمهوری اسلامی ایران عمل کنند و هیچ گونه فعالیتی خارج از این چارچوب انجام ندهند. بدیهی است که در صورت انجام اعمال خلاف قوانین و مقررات جاری کشور از سوی کاربر، مسئولیتی متوجه ایران بیزنس کاپ نخواهد بود.",
        },
        {
          id: "3",
          text: "ایجاد وب‌سایت یا اپلیکیشن و هرگونه فعالیت اعم از تبلیغات و… به نام ایران بیزنس کاپ  یا استفاده از اطلاعات کسب شده از آن، بدون اجازه کتبی افراد دارای سمت ممنوع بوده و دارای پیگرد قانونی است. ایران بیزنس کاپ  مسئول این قبیل اقدامات متقلبانه در مقابل اشخاص ثالث نیست.",
        },
        {
          id: "4",
          text: "کاربر با استفاده از خدمات ایران بیزنس کاپ می‌پذیرد در صورت نقض هر کدام از تعهدات مذکور در این موافقتنامه، ایران بیزنس کاپ مجاز به انجام بررسی و اتخاذ تصمیم مقتضی است و در صورت نیاز هر اقدامی مانند عدم اجازه حضور در مسابقات و گزارش به مراجع ذی‌صلاح قانونی را به انجام می‌رساند.",
        },
        {
          id: "5",
          text: " به منظور جلوگیری از بروز هر گونه اخلال و بی نظمی در فرآیند برگزاری مسابقات، در صورت وجود اعتراض، ضروری است موارد به شرح ذیل اقدام گردد:",
        },
      ],
    },
    {
      id: "3",
      title: "هزینه ها و پرداخت ها",
      explain: [
        {
          id: "1",
          text: "شرکت های طرف قرارداد می‌پذیرند امکان استرداد هزینه ی ثبت نام در مسابقه به شرکت ایده پردازان نیکداد اروین می‌پردازند وجود ندارد. شرکت های طرف قرارداد تنها تا 2 ساعت اولیه پس از واریز اجازه درخواست استرداد مبلغ و انصراف را دارند.",
        },
        {
          id: "2",
          text: "پرداخت هزینه ثبت نام تنها  از طریق روش هایی که توسط شرکت ایده پردازان نیکداد اروین مشخص میشود میتواند صورت بگیرد. این روش ها عبارت اند از : واریز به حساب بانک پاسارگاد شرکت ایده پردازان نیکداد اروین به شماره سپرده 312.8100.17900.608.1 وشماره شبا 610570031281017900608101. روش های پرداخت محدود به موارد مذکور بوده است. هرگونه روش دیگری مورد تایید شرکت نیست و در این صورت شرکت هیچگونه مسئولیتی بر عهده نخواهد داشت.",
        },
        {
          id: "3",
          text: "پرداخت هزینه ثبت نام تنها تا 48 ساعت پس از عقد قرار داد امکان پذیر است.",
        },
        {
          id: "4",
          text: "هرگونه کارمزد، کمیسیون و دیگر هزینه‌‌هایی که سیستم بانکی جهت نقل و انتقال پول به کاربر اضافه کند، بر عهده‌ی کاربر خواهد بود.",
        },
      ],
    },
    {
      id: "4",
      title: "شرایط شرکت در ایران بیزینس کاپ",
      explain: [
        {
          id: "1",
          text: "داشتن سابقه پرداخت بیمه تامین اجتماعی سه ماه متوالی اجباری از شرکت اعزام کننده از تاریخ صدور و تامین اعتبار آن تا شروع مسابقات. (کلیه بیمه های تکمیلی مرتبط با تأمین اجتماعی در صورت ارائه تأییدیه از سوی سازمان تأمین اجتماعی مورد پذیرش خواهد بود). ",
        },
        {
          id: "2",
          text: "ثبت نام در سامانه ی ایران بیزینس کاپ و داشتن قرارداد رسمی بین شرکت ایده پردازان نیکداد اروین و شرکت کننده  با مهر و امضاء الزامیست.",
        },
        {
          id: "3",
          text: "همراه داشتن اصل کارت ملی یا شناسنامه، بیمه ورزشی (ارائه شده توسط ایران بیزنس کاپ) الزامی است.",
        },
        {
          id: "4",
          text: "همراه داشتن اصل کارت حضور در رقابتهای ایران بیزینس کاپ که توسط هیئت مربوطه با الصاق عکس ورزشکار صادر شده باشد.",
        },
        {
          id: "5",
          text: "از پذیرش نفرات اضافی و افراد غیر مسئول به همراه تیم های اعزامی جداً ممانعت بعمل خواهد آمد.",
        },
        {
          id: "6",
          text: "از پذیرش تیم های ثبت نام نشده در تاریخ مقرر(در سامانه مذکور)در مسابقات ممانعت بعمل خواهد آمد.",
        },
        {
          id: "7",
          text: "حضور مدیر و مربی تیم ها در جلسه توجیهی قبل شروع مسابقات الزامی است.",
        },
        {
          id: "8",
          text: "هر تیم شامل حداقل پنج و حداکثر دوازده بازیکن، یک نفر سرمربی، یک مربی و یک نفر سرپرست مربوطه جمعا 15 نفرخواهد بود. (مربیان و مدیر حق بازی در تیم را ندارند)",
        },
        {
          id: "9",
          text: "حضور ورزشکارانی که در سالهای 1401 و 1402  عضو تیم های ملی بوده اند یا در لیگ برتر بازی کرده اند، در مسابقات ممنوع می باشد. ",
        },
      ],
    },
    {
      id: "5",
      title: "شرایط فسخ قرارداد",
      explain: [
        {
          id: "1",
          text: "اگر یکی از شرکت‌ها یا طرفین قرارداد به تعهدات ذکر شده در قرارداد عمل ننماید، هر دوطرف حق فسخ قرارداد را دارند. در صورت فسخ قرارداد از طرف شرکت ایده پردازان نیکداد اروین ، یا عدم برگزاری مطلق  مسابقات ایران بیزینس کاپ ، هزینه ثبت نام به صورت کامل به شرکت های طرف قرارداد عودت داده خواهد شد.",
        },
        {
          id: "2",
          text: "تمامی شرکت های طرف قرارداد ، تا 48 ساعت پس از عقد قرارداد ، امکان فسخ قرارداد را خواهند داشت.",
        },
        {
          id: "3",
          text: "اگر یکی از شرکت‌ها یا شرکت‌کنندگان از قوانین مرتبط با مسابقه ورزشی (مانند عضو بودن شرکت کنندگان در تیم های ملی یا لیگ برتر) تخلف کند، پس از انجام بررسی های تکمیلی و تایید تخلف، قرارداد فسخ خواهد شد و شرکت های طرف قرارداد حق اعتراض یا درخواست عودت هزینه ثبت نام را ندارند.",
        },
      ],
    },
    {
      id: "6",
      title: "موارد عدم مسئولیت شرکت ایده پردازان نیکداد اروین",
      explain: [
        {
          id: "1",
          text: "شرایط آب و هوایی: در برخی مواقع، شرایط جوی پیش‌بینی نشده ممکن است باعث تعویق یا لغو بازی‌ها شود. در این شرایط تاریخ برگزاری مسابقات تغییر کرده و به شرکت کنندگان اعلام خواهد شد.",
        },
        {
          id: "2",
          text: "اعتصاب بازیکنان: در صورت اعتصاب بازیکنان یا کادر فنی، شرکت مسئولیتی در قبال ادامه مسابقات ندارد.",
        },
        {
          id: "3",
          text: "تصمیمات داوری: تصمیمات داوران ممکن است مورد اعتراض باشد، اما شرکت مسئولیتی در قبال این تصمیمات ندارد.",
        },
        {
          id: "4",
          text: "موارد اضطراری و بحرانی: در شرایط بحرانی مانند بروز اتفاقات خاص مثل بیماری های همه‌گیر یا وقایع غیرمنتظره دیگر، شرکت مسئولیتی در قبال تصمیم‌گیری‌ها ندارد.",
        },
        {
          id: "5",
          text: "تغییرات در قوانین بازی: اگر قوانین بازی توسط فدراسیون فوتسال تغییر کند، شرکت از هر مسئولیتی در این زمینه مبرا می‌باشد.",
        },
        {
          id: "6",
          text: "شرایط مالی: شرکت مسئولیتی در قبال رفت و آمد، اقامت و تامین وعده های غذایی در روز های بازی برای اعضای تیم را نمی‌پذیرد.",
        },
        {
          id: "7",
          text: "شرایط حقوقی و قضایی: در صورت وقوع مسائل حقوقی یا دعاوی قضایی مرتبط با تیم ها، شرکت از هر گونه مسئولیتی در این زمینه مبرا می‌باشد.",
        },
      ],
    },
  ];

  return (
    <>
      <Helmet>
        <title>قوانین ثبت نام</title>
      </Helmet>

      <Navbar />
      <div className={`${classes.registerRulesWrapper} shape-box`}>
        <div className={classes.title}>
          <p>شرایط، قوانین و مقررات استفاده از خدمات ایران بیزینس کاپ </p>
        </div>
        <div className={classes.abstract}>
          <p>
            ایران بیزینس کاپ بستری برای گسترش کسب و کارها از طریق یک رویداد
            ورزشی است و تحت قوانین و شرایط زیر خدمات خود را ارائه می‌‌دهد. شرکت
            ایده پردازان نیکداد اروین شریک انحصاری شرکت گلدن اسپرت اتریش بوده و
            مجری این طرح می باشد.
          </p>
          <p>
            این قوانین به‌عنوان یک قرارداد الزام‌آور بر روابط بین «ایده پردازان
            نیکداد اروین» و تمامی طرف تجاری خواهد بود. بر این اساس، ضروری است
            پیش از استفاده از خدمات «ایران بیزینس کاپ» تمامی شروط را به دقت
            مطالعه کنید. ممکن است ایده پردازان نیکداد اروین شرایط و مقررات
            استفاده از خدمات ایران بیزینس کاپ را در طول زمان تغییر دهد.
          </p>
        </div>
        <div className={classes.definitions}>
          <h2>تعاریف و اصطلاحات</h2>
          <p>
            اصطلاحاتی که در شرایط و قوانین به کار رفته است ،دارای معانی مشروح
            زیر است:
          </p>
          <ul>
            {definitions.map((definition) => (
              <li key={definition.id} className={classes.definition}>
                <span className={classes.title}>{definition.title}: </span>
                <p>{definition.explain}</p>
              </li>
            ))}
          </ul>
        </div>
        <div className={classes.rules}>
          <ol className={classes.ruleslist}>
            {rules.map((rule) => (
              <li key={rule.id}>
                <div className={classes.title}>
                  <p>{rule.title}</p>
                </div>
                <ol className={classes.explain}>
                  {rule.explain.map((subRule) => (
                    <li>
                      <p>{subRule.text}</p>
                    </li>
                  ))}
                  {rule.id === "2" && (
                    <div className={classes.tabsare}>
                      <p>
                        الف- به صورت مکتوب و خطاب به مجریان ایران بیزینس کاپ و
                        حداکثر تا ۲ ساعت بعد از مسابقه به نماینده ایران بیزینس
                        کاپ تحویل گردیده و رسید دریافت نمایند.
                      </p>
                      <p>ب- اعتراض با امضاء سرپرست تیم مربوطه باشد.</p>
                      <p>
                        ج- به ازاء هر مورد اعتراض مبلغ پنج میلیون ریال به حساب
                        شرکت ایده پردازان نیکداد اروین واریز گردد.
                      </p>
                      <p>
                        تبصره: جلسات کمیته اجرایی بلافاصله در محل مسابقات تشکیل
                        و رسیدگی آنی صورت خواهد پذیرفت و در صورت پذیرفته شدن
                        اعتراض، مبلغ واریزی عودت داده خواهد شد.
                      </p>
                    </div>
                  )}
                </ol>
              </li>
            ))}
          </ol>
        </div>
      </div>
      <Footer />
    </>
  );
};
